### 1. replace
* replace( to_replace=비교값, value=치환값)
* nan값은 np.nan으로 비교

In [4]:
import pandas as pd

In [5]:
#데이터셋 로드
df = pd.read_csv('data/nan_test.csv')
df

   n1  n2  n3  nan_1  nan_2
0   0   1   2    1.7    NaN
1   3   4   2    NaN    NaN
2   3   4   8    2.4    NaN
3   9  10  11    NaN    NaN
4  12  10  14    1.2    NaN
5  15  16  17    NaN    1.0

In [6]:
import numpy as np
df['nan_1'] == np.nan

0    False
1    False
2    False
3    False
4    False
5    False
Name: nan_1, dtype: bool

In [7]:
df.replace(to_replace=np.nan, value=3000)

   n1  n2  n3   nan_1   nan_2
0   0   1   2     1.7  3000.0
1   3   4   2  3000.0  3000.0
2   3   4   8     2.4  3000.0
3   9  10  11  3000.0  3000.0
4  12  10  14     1.2  3000.0
5  15  16  17  3000.0     1.0

In [9]:
df.replace(to_replace = {'nan_2' : np.nan}, value = 'nan2변경')

   n1  n2  n3  nan_1   nan_2
0   0   1   2    1.7  nan2변경
1   3   4   2    NaN  nan2변경
2   3   4   8    2.4  nan2변경
3   9  10  11    NaN  nan2변경
4  12  10  14    1.2  nan2변경
5  15  16  17    NaN     1.0